posts/2016-01-30-end-january-update.html

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> A General Update</h2>
<div class="outline-text-2" id="text-1">
<p>
This post is going to be a bit of a brain dump.
For the last 2-3 months, I have been working on a study of statistical relational learning.
A good review of the subject can be <a href="http://www.cs.umd.edu/srl-book/">seen in the book by the same name</a>.
The book is organized to show progress of the field from logic based solvers to probabilistic constructs such as Markov logic networks (MLNs).
</p>
</div>
</div>


<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">2</span> Probabilistic Soft Logic (PSL)</h2>
<div class="outline-text-2" id="text-2">
<p>
PSL is developed by <a href="https://getoor.soe.ucsc.edu/">Lise Getoor</a> (formerly at UMD, now at UC Santa Cruz) and others.
Like Markov Logic Networks, the language of PSL are logical atoms and statements.
However, unlike MLNs, PSL was designed with efficient inference in mind, as the truth values are "soft", \(\in [0,1]\).
The result of this innovation is that, rather than grounding out possible \(\{0,1\}\) truths at a combinatorial scale, having soft truth values  \(\in [0,1]\) allows for the program to be cast as a convex optimization problem, which conventional solvers can tackle.
Additionally, using the method of <a href="http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.483.4732&amp;rep=rep1&amp;type=pdf"><i>alternating direction method of multipliers (ADMM)</i></a>, one can take advantage of the particular structure of the problem to solver these problems more rapidly when compared to generic methods.
</p>
</div>

<div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> PSL Resources</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li><a href="https://lirias.kuleuven.be/handle/123456789/369430">A short introduction to probabilistic soft logic</a></li>
<li><a href="http://psl.umiacs.umd.edu/">PSL Home page at UMD</a></li>
<li><a href="https://github.com/linqs/psl">PSL Github</a></li>
<li><a href="https://www.google.com/search?q=Inference+with+ADMM+is+fast%2C+scalable%2C+and+straightforward+to+implement&amp;oq=Inference+with+ADMM+is+fast%2C+scalable%2C+and+straightforward+to+implement&amp;aqs=chrome..69i57&amp;sourceid=chrome&amp;es_sm=122&amp;ie=UTF-8">Some interesting PDFs</a></li>
</ol>
</div>
</div>
</div>


<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">3</span> General Resources</h2>
<div class="outline-text-2" id="text-3">
<p>
I found this <a href="https://www.youtube.com/watch?v=GhBHRhIsQIE">lecture by Raymond Mooney</a>, given at the <a href="http://allenai.org/">Allen AI Institute</a>, which mentions the relationship between MLN and PSL, to be very useful.
</p>
</div>
</div>
